public/documenting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="index.html">Giovanni's Diary</a> &gt; <a href="first-page.html">First Page</a> &gt;
</p>

<div id="outline-container-org5b40085" class="outline-2">
<h2 id="org5b40085">Documenting my Life</h2>
<div class="outline-text-2" id="text-org5b40085">
<p>
I have always been fascinated by the idea of documenting my life. I
get to save some moments and thoughts to reflect upon later, It
helps me to have a better sense of myself and my direction. In some
way It is a proof of my existence, a side effect of my being.
</p>

<p>
The way I have been documenting my time is always changing, this diary
is just the latest of my iterations. Yet, It creates something I will
look back to with a sense of nostalgia. After all, history has started
when we humans began to document it, most of what came before is now
lost and I think it is a shame.
</p>

<p>
I wish I had more data about what I did when I was little, or about my
first days of high school, or during my lowest moments. This keeps me
motivated to document what I am going through now, even when It seems
to be unimportant.
</p>

<hr />

<p>
Travel: <a href="first-page.html">First Page</a>
</p>
</div>
</div>
</div>
</body>
</html>
